# Визначаємо функцію, яка створює і повертає вкладену функцію для обчислення чисел Фібоначчі з кешуванням
def caching_fibonacci():
    # Ініціалізуємо словник для кешування результатів
    cache = dict()

    # Визначаємо вкладену функцію для обчислення n-го числа Фібоначчі
    def fibonacci(n):
        # Перевіряємо базові випадки: якщо n <= 0, повертаємо 0; якщо n == 1, повертаємо 1
        if n <= 0:
            return 0
        if n == 1:
            return 1
        # Якщо результат для n вже є в кеші, повертаємо його, уникаючи зайвих обчислень
        if n in cache:
            return cache[n]
        
        # Якщо результату в кеші немає, обчислюємо його через рекурсивний виклик і зберігаємо в кеш
        cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
        # Повертаємо обчислений результат
        return cache[n]
    # Повертаємо вкладену функцію, яка тепер може використовувати кеш для оптимізації обчислень
    return fibonacci